app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    @articles = Article.all

INSERT INTO `articles` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('title1', 'body1', 1, '2015-06-23 20:22:46', '2015-06-23 20:22:46')
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    respond_to do |format|
      if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
    def set_article
      begin
        @article = Article.find(params[:id])