app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`body`, `commentable_id`, `commentable_type`, `user_id`, `created_at`, `updated_at`) VALUES ('root1', 1, 'Article', 1, '2015-06-23 20:28:56', '2015-06-23 20:28:56')
---
  def create
    @parent = Article.find(params[:article_id]) if params[:article_id]
    @parent = Comment.find(params[:comment_id]) if params[:comment_id]
    @comment = @parent.comments.new(comment_params)
    @comment.user = current_user
    @comment.save

DELETE FROM `comments` WHERE `comments`.`id` = 8
---
  def destroy
    @comment.destroy

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = NULL LIMIT 1
---
    def set_comment
      begin
        @comment = Comment.find(params[:id])